### I)  load dataset

In [29]:
import pandas as pd
import pandas as pd
df1 = pd.read_csv('../data/grades.csv', index_col=[0])
df2 = pd.read_csv('../data/students.csv', index_col=[0])
df = pd.merge(df1, df2, on = 'ID_student')

In [30]:
df.head()

            Grade  Address  Age     Sex         GD Employed
ID_student
1              95  Chennai   19    Male  1st Class      yes
2              70    Delhi   20  Female  2nd Class       no
3              98   Mumbai   18    Male  1st Class       no
4              75     Pune   21  Female  2nd Class       no
5              89    Kochi   19    Male  1st Class       no

### II) 	Data  bucketing

In [31]:
display(f"1st Quantile : {df.Grade.quantile(.25)},  2nd Quantile : {df.Grade.quantile(.5)},3rd Quantile : {df.Grade.quantile(.57)}")

'1st Quantile : 55.0,  2nd Quantile : 75.0,3rd Quantile : 76.0'

In [32]:
df.shape

(232, 6)

In [36]:
# Create bins for the 'Grade' column
labels= ["-40" , '40-50', '50-60', '60-70', '70-80', "+80"]
df['Grade_categories'] = pd.cut(df['Grade'], bins=6,
                         labels=labels )
df.head()

            Grade  Address  Age     Sex         GD Employed Grade_categories
ID_student
1              95  Chennai   19    Male  1st Class      yes              +80
2              70    Delhi   20  Female  2nd Class       no            50-60
3              98   Mumbai   18    Male  1st Class       no              +80
4              75     Pune   21  Female  2nd Class       no            60-70
5              89    Kochi   19    Male  1st Class       no            70-80

In [ ]:
# Calculates Quantiles
df['age_quantile'] = pd.qcut(df['Age'], q=4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

In [7]:
df.head()

   ID_student  Age     Sex      Grade Employed age_quantile
0           1   19    Male  1st Class      yes           Q1
1           2   20  Female  2nd Class       no           Q2
2           3   18    Male  1st Class       no           Q1
3           4   21  Female  2nd Class       no           Q3
4           5   19    Male  1st Class       no           Q1